{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "KPrivateCodeLib",
			"Children": [
				{
					"Source":
					{
						"Text": "Reached global max count for this building (5)"
					},
					"Translation":
					{
						"Text": "Reached global max count for this building (5)"
					},
					"Key": "ConstructDisqualifier_MaxCountReached"
				}
			]
		},
		{
			"Namespace": "LOCTEXT_CPP_STRING_TABLE",
			"Children": [
				{
					"Source":
					{
						"Text": "SourceString"
					},
					"Translation":
					{
						"Text": "SourceString"
					},
					"Key": "Key"
				}
			]
		},
		{
			"Namespace": "ST_KPrivateCodeLib",
			"Children": [
				{
					"Source":
					{
						"Text": "<LightGrey12Reg>Thanks for using </><Orange12Reg>KMods</>"
					},
					"Translation":
					{
						"Text": "<LightGrey12Reg>Thanks for using </><Orange12Reg>KMods</>"
					},
					"Key": "Widget_SettingPopup.RichTextBlock.Text"
				},
				{
					"Source":
					{
						"Text": "<LightGrey12Reg>we want you to be able to decide whether and </><Orange12Reg>which advertising you want to see!</>\r\n<LightGrey12Reg>You can change this at any time in the </><Orange12Reg>KPrivateLib Mod Configs.</>\r\n\r\n<Orange12Reg>This popup will only appear once</>"
					},
					"Translation":
					{
						"Text": "<LightGrey12Reg>we want you to be able to decide whether and </><Orange12Reg>which advertising you want to see!</>\r\n<LightGrey12Reg>You can change this at any time in the </><Orange12Reg>KPrivateLib Mod Configs.</>\r\n\r\n<Orange12Reg>This popup will only appear once</>"
					},
					"Key": "Widget_SettingPopup.RichTextBlock_108.Text"
				},
				{
					"Source":
					{
						"Text": "Cannot Snap this module to the building. (To much, Invalid or no Place)"
					},
					"Translation":
					{
						"Text": "Cannot Snap this module to the building. (To much, Invalid or no Place)"
					},
					"Key": "Disqualifier_ToMuchModules.Disqualifier_ToMuchModules_C.mDisqfualifyingText"
				},
				{
					"Source":
					{
						"Text": "Collapsed"
					},
					"Translation":
					{
						"Text": "Collapsed"
					},
					"Key": "Wiget_KeyBind.K2Node_Select_0.EnumEntryFriendlyNames[1]"
				},
				{
					"Source":
					{
						"Text": "Default"
					},
					"Translation":
					{
						"Text": "Default"
					},
					"Key": "BP_SwatchSystem.K2Node_FunctionEntry_0.LocalVariables[0].Category"
				},
				{
					"Source":
					{
						"Text": "Discord UserID"
					},
					"Translation":
					{
						"Text": "Discord UserID"
					},
					"Key": "KPCL_Config.BP_ConfigPropertyString_C_0.DisplayName"
				},
				{
					"Source":
					{
						"Text": "Edit"
					},
					"Translation":
					{
						"Text": "Edit"
					},
					"Key": "BPW_KPCL_CustomiserSettingsButton.TextBlock_148.Text"
				},
				{
					"Source":
					{
						"Text": "Enable Sink Option"
					},
					"Translation":
					{
						"Text": "Enable Sink Option"
					},
					"Key": "NetworkSchematic_Unlock_AllowOverflowSink.BP_UnlockInfoOnly_C_0.mUnlockName"
				},
				{
					"Source":
					{
						"Text": "Enable pull rules"
					},
					"Translation":
					{
						"Text": "Enable pull rules"
					},
					"Key": "NetworkSchematic_Unlock_Pull.BP_UnlockInfoOnly_C_0.mUnlockName"
				},
				{
					"Source":
					{
						"Text": "Enable push rule"
					},
					"Translation":
					{
						"Text": "Enable push rule"
					},
					"Key": "NetworkSchematic_Unlock_Push.BP_UnlockInfoOnly_C_0.mUnlockName"
				},
				{
					"Source":
					{
						"Text": "Enable remote access"
					},
					"Translation":
					{
						"Text": "Enable remote access"
					},
					"Key": "NetworkSchematic_Unlock_RemoteAccess.BP_UnlockInfoOnly_C_0.mUnlockName"
				},
				{
					"Source":
					{
						"Text": "Hidden"
					},
					"Translation":
					{
						"Text": "Hidden"
					},
					"Key": "Wiget_KeyBind.K2Node_Select_0.EnumEntryFriendlyNames[2]"
				},
				{
					"Source":
					{
						"Text": "Info"
					},
					"Translation":
					{
						"Text": "Info"
					},
					"Key": "BP_KPCLUnlockSubsytem.Sprite.SpriteInfo.DisplayName"
				},
				{
					"Source":
					{
						"Text": "Inventory Pull"
					},
					"Translation":
					{
						"Text": "Inventory Pull"
					},
					"Key": "NetworkSchematic_Unlock_Pull.NetworkSchematic_Unlock_Pull_C.mDisplayName"
				},
				{
					"Source":
					{
						"Text": "Inventory Push Module"
					},
					"Translation":
					{
						"Text": "Inventory Push Module"
					},
					"Key": "NetworkSchematic_Unlock_Push.NetworkSchematic_Unlock_Push_C.mDisplayName"
				},
				{
					"Source":
					{
						"Text": "K.Mods Patreons"
					},
					"Translation":
					{
						"Text": "K.Mods Patreons"
					},
					"Key": "Widget_KPCL_PatreonsList.mHeadline.Text"
				},
				{
					"Source":
					{
						"Text": "KMods"
					},
					"Translation":
					{
						"Text": "KMods"
					},
					"Key": "IMC_KPCL_Equipment.mDisplayName"
				},
				{
					"Source":
					{
						"Text": "KMods|MapDisplay"
					},
					"Translation":
					{
						"Text": "KMods|MapDisplay"
					},
					"Key": "BP_KPCLCreatureSpawner.NewVariables[0].Category"
				},
				{
					"Source":
					{
						"Text": "Missing master Building cannot attach module!"
					},
					"Translation":
					{
						"Text": "Missing master Building cannot attach module!"
					},
					"Key": "Disqualifier_MissingMaster.Disqualifier_MissingMaster_C.mDisqfualifyingText"
				},
				{
					"Source":
					{
						"Text": "Module is not allowed here"
					},
					"Translation":
					{
						"Text": "Module is not allowed here"
					},
					"Key": "Disqualifier_ModuleNowAllowed.Disqualifier_ModuleNowAllowed_C.mDisqfualifyingText"
				},
				{
					"Source":
					{
						"Text": "Not Hit-Testable (Self & All Children)"
					},
					"Translation":
					{
						"Text": "Not Hit-Testable (Self & All Children)"
					},
					"Key": "Wiget_KeyBind.K2Node_Select_0.EnumEntryFriendlyNames[3]"
				},
				{
					"Source":
					{
						"Text": "Not Hit-Testable (Self Only)"
					},
					"Translation":
					{
						"Text": "Not Hit-Testable (Self Only)"
					},
					"Key": "Wiget_KeyBind.K2Node_Select_0.EnumEntryFriendlyNames[4]"
				},
				{
					"Source":
					{
						"Text": "Not shown"
					},
					"Translation":
					{
						"Text": "Not shown"
					},
					"Key": "BPW_KPCL_Editor.mPrimary.Keybindings[0].HintText"
				},
				{
					"Source":
					{
						"Text": "Patreon Code"
					},
					"Translation":
					{
						"Text": "Patreon Code"
					},
					"Key": "KPCL_Config.BP_ConfigPropertyString_C_1.DisplayName"
				},
				{
					"Source":
					{
						"Text": "Patreon Configuration"
					},
					"Translation":
					{
						"Text": "Patreon Configuration"
					},
					"Key": "KPCL_Config.BP_ConfigPropertySection_C_0.HeaderText"
				},
				{
					"Source":
					{
						"Text": "Private Code Lib for all K.Mods"
					},
					"Translation":
					{
						"Text": "Private Code Lib for all K.Mods"
					},
					"Key": "KPCL_Config.KPCL_Config_C.DisplayName"
				},
				{
					"Source":
					{
						"Text": "Remote Access"
					},
					"Translation":
					{
						"Text": "Remote Access"
					},
					"Key": "NetworkSchematic_Unlock_RemoteAccess.NetworkSchematic_Unlock_RemoteAccess_C.mDisplayName"
				},
				{
					"Source":
					{
						"Text": "Render Opacity"
					},
					"Translation":
					{
						"Text": "Render Opacity"
					},
					"Key": "MovieSceneFloatTrack_2.DisplayName"
				},
				{
					"Source":
					{
						"Text": "Save And Close"
					},
					"Translation":
					{
						"Text": "Save And Close"
					},
					"Key": "Widget_SettingPopup.Widget_StandardButton.mText"
				},
				{
					"Source":
					{
						"Text": "Save Color"
					},
					"Translation":
					{
						"Text": "Save Color"
					},
					"Key": "BPW_KPCL_CustomiserSaveIcon.mMaterialName.Text"
				},
				{
					"Source":
					{
						"Text": "Show KMods Neewsfeed (SoonTM)"
					},
					"Translation":
					{
						"Text": "Show KMods Neewsfeed (SoonTM)"
					},
					"Key": "Widget_SettingPopup.TextBlock_2.Text"
				},
				{
					"Source":
					{
						"Text": "Show KMods News Feed (SoonTM)"
					},
					"Translation":
					{
						"Text": "Show KMods News Feed (SoonTM)"
					},
					"Key": "KPCL_Config.BP_ConfigPropertyBool_C_2.DisplayName"
				},
				{
					"Source":
					{
						"Text": "Show Patreon Button"
					},
					"Translation":
					{
						"Text": "Show Patreon Button"
					},
					"Key": "KPCL_Config.BP_ConfigPropertyBool_C_1.DisplayName"
				},
				{
					"Source":
					{
						"Text": "Show Patreon List"
					},
					"Translation":
					{
						"Text": "Show Patreon List"
					},
					"Key": "KPCL_Config.BP_ConfigPropertySection_C_0.BP_ConfigPropertyBool_C_0.DisplayName"
				},
				{
					"Source":
					{
						"Text": "Sink Utility"
					},
					"Translation":
					{
						"Text": "Sink Utility"
					},
					"Key": "NetworkSchematic_Unlock_AllowOverflowSink.NetworkSchematic_Unlock_AllowOverflowSink_C.mDisplayName"
				},
				{
					"Source":
					{
						"Text": "Swatch Name"
					},
					"Translation":
					{
						"Text": "Swatch Name"
					},
					"Key": "BPW_KPCL_Editor.TextBlock.Text"
				},
				{
					"Source":
					{
						"Text": "Target Function"
					},
					"Translation":
					{
						"Text": "Target Function"
					},
					"Key": "Hook_PlayerWidget.HookTargetNode_TargetExpression_14.GeneratedMemberReferenceDescriptors[0].DisplayName"
				},
				{
					"Source":
					{
						"Text": "Text Block"
					},
					"Translation":
					{
						"Text": "Text Block"
					},
					"Key": "Widget_PatreonUser.mUserName.Text"
				},
				{
					"Source":
					{
						"Text": "Thanks to all supporter!"
					},
					"Translation":
					{
						"Text": "Thanks to all supporter!"
					},
					"Key": "Widget_KPCL_PatreonsList.mHeadline_1.Text"
				},
				{
					"Source":
					{
						"Text": "Use Custom Swatch System"
					},
					"Translation":
					{
						"Text": "Use Custom Swatch System"
					},
					"Key": "KPCL_Config.BP_ConfigPropertySection_C_0.BP_ConfigPropertySection_C_0.BP_ConfigPropertyBool_C_0.DisplayName"
				},
				{
					"Source":
					{
						"Text": "Use Wire Switch System"
					},
					"Translation":
					{
						"Text": "Use Wire Switch System"
					},
					"Key": "KPCL_Config.BP_ConfigPropertyBool_C_3.DisplayName"
				},
				{
					"Source":
					{
						"Text": "User Created"
					},
					"Translation":
					{
						"Text": "User Created"
					},
					"Key": "BPW_KPCL_CustomiserSaveIcon.BPW_KPCL_CustomiserSaveIcon_C.PaletteCategory"
				},
				{
					"Source":
					{
						"Text": "Visible"
					},
					"Translation":
					{
						"Text": "Visible"
					},
					"Key": "Wiget_KeyBind.K2Node_Select_0.EnumEntryFriendlyNames[0]"
				}
			]
		},
		{
			"Namespace": "ST_NetworkTier",
			"Children": [
				{
					"Source":
					{
						"Text": "Unlock new network tier"
					},
					"Translation":
					{
						"Text": "Unlock new network tier"
					},
					"Key": "KPCL_NetNetworkTier"
				}
			]
		}
	]
}